4.1 Inserting a New Record

In [ ]:
insert into 
    dbo.DEPT (DEPTNO, DNAME, LOC)
    values (50, 'PROGRAMMING', 'BALTIMORE');

select * from dbo.DEPT as d;

4.2 Inserting Default Values

In [ ]:
drop table dbo.D;

create table D 
(
    id integer default 0
);

insert into dbo.D (id) values (default);

insert into dbo.D default values;

select * from dbo.D

4.3 Overriding a Default Value with Null

In [ ]:
drop table dbo.D;

create table D 
(
    id integer default 0,
    foo varchar(10)
);

insert into 
    dbo.D (id, foo)
    values (null, 'Brighten');

select * from dbo.D;

4.4 Copying Rows from One Table into Another

In [ ]:
drop table dbo.DEPT_EAST;

create table DEPT_EAST
(
    deptno integer,
    dname varchar(100), 
    loc varchar(100)
);

insert into 
    dbo.DEPT_EAST (deptno, dname, loc)
    select 
        d.DEPTNO,
        d.DNAME,
        d.LOC
    from 
        dbo.DEPT as d
    where 
        d.LOC in ('NEW YORK', 'BOSTON');

select * from dbo.DEPT_EAST;

4.5 Copying a Table Definition

In [ ]:
drop table dbo.DEPT_WITHOUT_LINES;
drop table dbo.DEPT_WITH_LINES;

select 
    *
into 
    DEPT_WITHOUT_LINES
from 
    dbo.DEPT as d
where 1 = 0; -- Expression 1 = 0 causes no rows to be returned

select 
    *
into 
    DEPT_WITH_LINES
from 
    dbo.DEPT as d
where 1 = 1;

select * from dbo.DEPT_WITHOUT_LINES;
select * from dbo.DEPT_WITH_LINES;

4.6 Inserting into Multiple Tables at Once

4.7 Blocking Inserts to Certain Columns

4.8 Modifying Records in a Table

In [ ]:
drop table dbo.EMP_COPY;

select 
    * 
into
    EMP_COPY 
from 
    dbo.EMP as e
where 
    1 = 1;

-- solution
update dbo.EMP_COPY
    set sal = (sal * 1.10)
where 
    DEPTNO = 20;

select * from dbo.EMP_COPY;

4.9 Updating When Corresponding Rows Exist

In [ ]:
--setup 
drop table dbo.EMP_BONUS;
drop table dbo.EMP_COPY;

create table EMP_BONUS
(
    EMPNO int not null,
    ENAME varchar(100)
);

insert into 
    dbo.EMP_BONUS (EMPNO, ENAME)
values 
    (7369, 'SMITH'),
    (7900, 'JAMES'),
    (7934, 'MILLER');

select 
    * 
into
    EMP_COPY 
from 
    dbo.EMP as e
where 
    1 = 1;

select * from dbo.EMP_COPY

-- solution
update 
    dbo.EMP_COPY
set 
    sal = (sal * 1.20)
where 
    EMPNO in (select eb.EMPNO from dbo.EMP_BONUS as eb);

select * from dbo.EMP_COPY;

-- alternative solution using EXISTS clause
update 
    dbo.EMP_COPY
set 
    sal = (sal * 1.20)
where 
    exists (select null from dbo.EMP_BONUS as eb where EMP_COPY.EMPNO = eb.EMPNO);

select * from dbo.EMP_COPY;

4.10 Updating with Values from Another Table

In [ ]:
-- setup
drop table dbo.EMP_COPY;
drop table dbo.NEW_SAL;

create table NEW_SAL
(
    DEPTNO int not null,
    SAL decimal 
);

insert into 
    dbo.NEW_SAL (DEPTNO, SAL)
values 
    (10, 4000);
    
select 
    * 
into
    EMP_COPY 
from 
    dbo.EMP as e
where 
    1 = 1;

select * from dbo.EMP_COPY

-- solution
update 
    e
set 
    e.SAL = ns.SAL,
    e.COMM = ns.SAL / 2
from 
    dbo.EMP_COPY as e
inner join 
    dbo.NEW_SAL as ns on e.DEPTNO = ns.DEPTNO;

select ec.DEPTNO, ec.ENAME, ec.SAL, ec.COMM from dbo.EMP_COPY as ec order by ec.DEPTNO

4.11 Merging Records

In [ ]:
-- setup
drop table dbo.EMP_COPY;
drop table dbo.EMP_COMMISSION;

create table EMP_COMMISSION
(
    DEPTNO integer,
    EMPNO integer,
    ENAME varchar(100),
    COMM decimal 
);

insert into 
    dbo.EMP_COMMISSION (DEPTNO, EMPNO, ENAME, COMM)
values 
    (10, 7782, 'CLARK', null),
    (10, 7839, 'KING', null),
    (10, 7934, 'MILLER', null);
    
select 
    * 
into
    EMP_COPY 
from 
    dbo.EMP as e
where 
    1 = 1;

select * from dbo.EMP_COPY


-- solution
merge into 
    dbo.EMP_COMMISSION as ec
using 
    (select * from dbo.EMP_COPY) as emp on (ec.EMPNO = emp.EMPNO)
when matched then 
    update set ec.comm = 1000
when not matched and emp.SAL >= 2000 then 
    insert (EMPNO, ENAME, DEPTNO, COMM)
    values(emp.EMPNO, emp.ENAME, emp.DEPTNO, emp.COMM);

select * from dbo.EMP_COMMISSION;

4.12 Deleting All Records from a Table

In [ ]:
-- setup
drop table dbo.EMP_COPY;
    
select 
    * 
into
    EMP_COPY 
from 
    dbo.EMP as e
where 
    1 = 1;

-- solution
delete from dbo.EMP_COPY;

select * from dbo.EMP_COPY;

4.13 Deleting Specific Records

In [ ]:
-- setup
drop table dbo.EMP_COPY;
    
select 
    * 
into
    EMP_COPY 
from 
    dbo.EMP as e
where 
    1 = 1;

-- solution
delete from 
    dbo.EMP_COPY
where 
    DEPTNO = 10;

select * from dbo.EMP_COPY;

4.14 Deleting a Single Record

In [ ]:
-- setup
drop table dbo.EMP_COPY;
    
select 
    * 
into
    EMP_COPY 
from 
    dbo.EMP as e
where 
    1 = 1;

-- solution
delete from 
    dbo.EMP_COPY
where 
    EMPNO = 7782;

select * from dbo.EMP_COPY;

4.15 Deleting Referential Integrity Violations

In [ ]:
-- setup
drop table dbo.EMP_COPY;
    
select 
    * 
into
    EMP_COPY 
from 
    dbo.EMP as e
where 
    1 = 1;

-- solution
delete from 
    dbo.EMP_COPY
where 
    not exists 
    (
        select null from dbo.DEPT as d where d.DEPTNO = EMP_COPY.DEPTNO
    );

select * from dbo.EMP_COPY;

4.16 Deleting Duplicate Records

In [95]:
-- setup
drop table dbo.DUPES;

create table DUPES
(
    id integer,
    [name] varchar(30)
);

insert into 
    dbo.DUPES
values 
    (1, 'NAPOLEON'),
    (2, 'DYNAMITE'),
    (3, 'DYNAMITE'),
    (4, 'SHE SELLS'),
    (5, 'SEA SHELLS'),
    (6, 'SEA SHELLS'),
    (7, 'SEA SHELLS')

-- solution
delete from 
    dbo.DUPES
where 
    id not in ( select min(d.id) from dbo.DUPES as d group by d.name);

select * from dbo.DUPES;

id,name
1,NAPOLEON
2,DYNAMITE
4,SHE SELLS
5,SEA SHELLS

4.17 Deleting Records Referenced from Another Table

In [98]:
-- setup
drop table dbo.DEPT_ACCIDENTS;
drop table dbo.EMP_COPY;

create table DEPT_ACCIDENTS
(
    DEPTNO integer,
    ACCIDENT_NAME varchar(30)
);

insert into 
    dbo.DEPT_ACCIDENTS
values 
    (10, 'BROKEN FOOT'),
    (10, 'FLESH WOUND'),
    (20, 'FIRE'),
    (20, 'FIRE'),
    (20, 'FLOOD'),
    (30, 'BRUISED GLUTE');

select * from dbo.DEPT_ACCIDENTS;

select 
    * 
into
    EMP_COPY 
from 
    dbo.EMP as e
where 
    1 = 1;

-- solution 
delete from 
    dbo.EMP_COPY
where 
    DEPTNO in (select da.DEPTNO from dbo.DEPT_ACCIDENTS as da group by da.DEPTNO having count(da.DEPTNO) >= 3);

DEPTNO,ACCIDENT_NAME
10,BROKEN FOOT
10,FLESH WOUND
20,FIRE
20,FIRE
20,FLOOD
30,BRUISED GLUTE